minimax_bench/kernel_traces/level3/level3_isl8192_conc8_bench.log
[aiter] import [module_aiter_enum] under /app/aiter-test/aiter/jit/module_aiter_enum.so
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(backend='vllm', base_url='http://localhost:8200', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=8, model='MiniMaxAI/MiniMax-M2.5', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=50, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=True, save_result=True, save_detailed=False, metadata=None, result_dir='minimax_bench/kernel_traces/level3', result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=50, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=1)
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6625  max=8177  mean=7311.72  avg_token_mismatch=0.00  
 output_lens: min=40    max=50    mean=44.94   
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 1 requests...
100%|██████████| 1/1 [00:01<00:00,  1.92s/it]
Warmup completed.
Starting profiler...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 50/50 [00:16<00:00,  2.94it/s]
Starting main benchmark run...
Stopping profiler...
============ Serving Benchmark Result ============
Successful requests:                     50        
Benchmark duration (s):                  16.98     
Total input tokens:                      365586    
Total generated tokens:                  2247      
Request throughput (req/s):              2.94      
Output token throughput (tok/s):         132.35    
Total Token throughput (tok/s):          21665.06  
---------------Time to First Token----------------
Mean TTFT (ms):                          607.95    
Median TTFT (ms):                        522.82    
P99 TTFT (ms):                           1870.51   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          46.41     
Median TPOT (ms):                        46.66     
P99 TPOT (ms):                           68.08     
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.51     
Median ITL (ms):                         18.07     
P99 ITL (ms):                            666.01    
==================================================